system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

meshX 232;
meshY 202;



convertToMeters 1;

vertices
(
(0      0     0) //0
(0.202  0     0) //1
(0.202 -0.013 0) //2
(0     -0.013 0) //3

(-0.03 -0.013 0) //4
(-0.03  0     0) //5

(0      0.189 0) //6
(0.202  0.189 0) //7

(0      0     0.1) //8
(0.202  0     0.1) //9
(0.202 -0.013 0.1) //10
(0     -0.013 0.1) //11

(-0.03 -0.013 0.1) //12
(-0.03  0     0.1) //13

(0      0.189 0.1) //14
(0.202  0.189 0.1) //15


);

blocks
(

    //(y x z)
    hex (0 3 2 1 8 11 10 9) //1
    (13 202 1)
    simpleGrading (1 1 1)

    hex (5 4 3 0 13 12 11 8) //2
    (13 30 1)
    simpleGrading (1 1 1)

    hex (6 0 1 7 14 8 9 15) //3
    (189 202 1)
    simpleGrading (1 1 1)


);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (4 12 13 5)
        );
    }

    front
    {
        type symmetry;
        faces
        (
            (12 13 8 11)
            (11 8 9 10)
            (8 14 15 9)
        );
    }

    back
    {
        type symmetry;
        faces
        (
            (4 5 0 3)
            (3 0 1 2)
            (0 6 7 1)
        );
    }

    tank
    {
        type wall;
        faces
        (
            (13 5 0 8)
            (8 0 6 14)
            (14 6 7 15)
            (15 7 1 9)
            (9 1 2 10)
            (10 2 3 11)
            (11 3 4 12)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
