constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          13;
        startFace       81954;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          41194;
        startFace       81967;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          41194;
        startFace       123161;
    }
    tank
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          623;
        startFace       164355;
    }
)

// ************************************************************************* //
